app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC
---
  def index
    @tasks = Task.all.order(:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i   #params is a method inherited from ApplicationController
    @task = Task.find_by(id: id)

INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "friday"], ["updated_at", "2018-09-24 03:30:31.581702"], ["id", 7]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
  def create
    @task = Task.new(task_params) #instantiate a new task
    if @task.save # save returns true if the database insert succeeds
      redirect_to root_path # go to the index so we can see the task in the list
    else # save failed :(
      render :new # show the new task form view again
      #render :new says go to the routes, and get the task route that makes a new book in the routes.rb, render follows the method path like books#new , books#edit,
    end
  end

  def edit #this method gives the user a form
    @task = Task.find(params[:id].to_i)

  end

  def update
    @task = Task.find_by(id: params[:id].to_i)
    @task.update(task_params)

    redirect_to task_path
  end

  def destroy
    task = Task.find_by(id: params[:id].to_i)
    task.destroy #deleted_task only exists when we run destroy it isn't saved in the database , using a instance variable allows us to use it in the erb page , rather than local variable

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed_at", nil], ["updated_at", "2018-09-24 03:32:02.697158"], ["id", 12]]
---
  def complete
    @task = Task.find_by(id: params[:id].to_i)
    if @task.completed_at == nil
      new_date = DateTime.now
    else
      new_date = nil
    end

    @task.update(completed_at: new_date)