app/controllers/tasks_controller.rb

  def mark_complete
    @task = Task.find_by(id: params[:id].to_i)
    @task.completed = true
    @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed_at", "2018-09-21 22:12:47.513384"], ["updated_at", "2018-09-21 22:12:47.520983"], ["id", 7]]